OpenFOAM-v1712/tutorials/compressible/rhoSimpleFoam/gasMixing/injectorPipe/system/abort
// OpenFOAM dictionary -*- C++ -*-

ABORT
{
    type    abort;
    libs    ("libutilityFunctionObjects.so");
    //file    "$FOAM_CASE/ABORT";   // default name
    // action  writeNow;
    action  nextWrite;
}


// ************************************************************************* //
